# Persiapkan Data

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
dataframe = pd.read_excel('data/doctor-fee.xlsx')
dataframe = dataframe.drop('Miscellaneous_Info',axis=1)

In [3]:
dataframe.head()

,Qualification,Experience,Rating,Place,Profile,Fees
0,"BHMS, MD - Homeopathy",24 years experience,100%,"Kakkanad, Ernakulam",Homeopath,100
1,"BAMS, MD - Ayurveda Medicine",12 years experience,98%,"Whitefield, Bangalore",Ayurveda,350
2,"MBBS, MS - Otorhinolaryngology",9 years experience,NaN,"Mathikere - BEL, Bangalore",ENT Specialist,300
3,"BSc - Zoology, BAMS",12 years experience,NaN,"Bannerghatta Road, Bangalore",Ayurveda,250
4,BAMS,20 years experience,100%,"Keelkattalai, Chennai",Ayurveda,250

In [4]:
def describe(dataframe):
    for col in list(dataframe):
        print(f'{col} : {len(dataframe[col].unique())} Unique Values, {len([i for i in dataframe[col] if type(i) == float])} NaN')

In [5]:
describe(dataframe)

Qualification : 1420 Unique Values, 0 NaN
Experience : 64 Unique Values, 0 NaN
Rating : 52 Unique Values, 3302 NaN
Place : 878 Unique Values, 25 NaN
Profile : 6 Unique Values, 0 NaN
Fees : 40 Unique Values, 0 NaN

# Mengisi Data Kosong Dengan Nilai Rata-Rata

In [6]:
for_mean = []
for rate in dataframe['Rating']:
    try:
        for_mean.append(int(rate[:-1]))
    except TypeError:
        pass

In [7]:
np.mean(for_mean)

94.64347499059797

In [8]:
rating = []
for rate in dataframe['Rating']:
    try:
        rating.append(float(rate[:-1]))
    except TypeError:
        rating.append(94.64347499059797)

In [9]:
dataframe = dataframe.drop('Rating',axis=1)

In [10]:
dataframe['Rating'] = rating

In [11]:
dataframe.head()

,Qualification,Experience,Place,Profile,Fees,Rating
0,"BHMS, MD - Homeopathy",24 years experience,"Kakkanad, Ernakulam",Homeopath,100,100.000000
1,"BAMS, MD - Ayurveda Medicine",12 years experience,"Whitefield, Bangalore",Ayurveda,350,98.000000
2,"MBBS, MS - Otorhinolaryngology",9 years experience,"Mathikere - BEL, Bangalore",ENT Specialist,300,94.643475
3,"BSc - Zoology, BAMS",12 years experience,"Bannerghatta Road, Bangalore",Ayurveda,250,94.643475
4,BAMS,20 years experience,"Keelkattalai, Chennai",Ayurveda,250,100.000000

# Konversi Data ke Numerical

In [12]:
'4 years experience'[:-17]

'4'

In [13]:
experience = []
for exp in dataframe['Experience']:
    exp = int(exp[:-17])
    experience.append(exp)

In [14]:
dataframe = dataframe.drop('Experience',axis=1)

In [15]:
dataframe['Experience'] = experience

In [16]:
dataframe.head()

,Qualification,Place,Profile,Fees,Rating,Experience
0,"BHMS, MD - Homeopathy","Kakkanad, Ernakulam",Homeopath,100,100.000000,24
1,"BAMS, MD - Ayurveda Medicine","Whitefield, Bangalore",Ayurveda,350,98.000000,12
2,"MBBS, MS - Otorhinolaryngology","Mathikere - BEL, Bangalore",ENT Specialist,300,94.643475,9
3,"BSc - Zoology, BAMS","Bannerghatta Road, Bangalore",Ayurveda,250,94.643475,12
4,BAMS,"Keelkattalai, Chennai",Ayurveda,250,100.000000,20

# Menghapus Data Kosong

In [17]:
# 25 Baris akan dihapus, jika kolom Place == NaN
describe(dataframe)

Qualification : 1420 Unique Values, 0 NaN
Place : 878 Unique Values, 25 NaN
Profile : 6 Unique Values, 0 NaN
Fees : 40 Unique Values, 0 NaN
Rating : 52 Unique Values, 5961 NaN
Experience : 64 Unique Values, 0 NaN

In [18]:
dataframe.dropna(subset = ['Place'], inplace=True)

In [19]:
describe(dataframe)

Qualification : 1419 Unique Values, 0 NaN
Place : 877 Unique Values, 0 NaN
Profile : 6 Unique Values, 0 NaN
Fees : 40 Unique Values, 0 NaN
Rating : 52 Unique Values, 5936 NaN
Experience : 64 Unique Values, 0 NaN

In [20]:
dataframe.head()

,Qualification,Place,Profile,Fees,Rating,Experience
0,"BHMS, MD - Homeopathy","Kakkanad, Ernakulam",Homeopath,100,100.000000,24
1,"BAMS, MD - Ayurveda Medicine","Whitefield, Bangalore",Ayurveda,350,98.000000,12
2,"MBBS, MS - Otorhinolaryngology","Mathikere - BEL, Bangalore",ENT Specialist,300,94.643475,9
3,"BSc - Zoology, BAMS","Bannerghatta Road, Bangalore",Ayurveda,250,94.643475,12
4,BAMS,"Keelkattalai, Chennai",Ayurveda,250,100.000000,20